DataProcessors/Renault_GetBin_WS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_GetBin_WS</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресWS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинWS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольWS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/Renault_GetBin_WS/Ext/ObjectModule.bsl
////@+ Процедура ПолучитьДанные()
//<xml version="1.0" encoding="UTF-8">
//<Автодок>
//<Процедура ТипПроцедуры="Экспорт"
//           ИнструкцииПрепроцессору=""
//           ДатаCоздания="21.05.2013 16:25:50" Автор="Окипний Андрей Евгеньевич">
// <Имя>ПолучитьДанные()</Имя>
//
// <Описание>
//  <!-- Вставить описание -->
// </Описание>
// </Параметры>
//  <!-- Без параметров -->
//</Процедура>
//</xml>
//@-
Функция ПолучитьОбработчик(НаименованиеОбработчика = "") Экспорт
	
	#Если НаКлиенте тогда
	Если НЕ ЗначениеЗаполнено(АдресWS) тогда 
		Предупреждение("Адрес не указан", 10);
		Возврат Неопределено;
	КонецЕсли;
	#КонецЕсли
	
	Попытка
		//удалим определение документа wsdl - его добавляем автоматически
		АдресWS = СокрЛП(АдресWS) + "ws/getclass.ws?wsdl";
		
		ВСОпределение = Новый WSОпределения(АдресWS, СокрЛП(ЛогинWS), СокрЛП(ПарольWS));
		
		ВебСервис = Новый WSПрокси(ВСОпределение, "http://renault-nissan.com/schema/binary", 
								   "ВыдачаОбработчиков","ВыдачаОбработчиковSoap12",600);
		
		ВебСервис.Пользователь	 = СокрЛП(ЛогинWS);
		ВебСервис.Пароль		 = СокрЛП(ПарольWS);
		
		обработчик = Неопределено;
		
		ОбработчикXDTO = ВебСервис.getbinary(СокрЛП(НаименованиеОбработчика));
		
		Если НЕ ОбработчикXDTO = Неопределено тогда
			
			ПолноеИмяОбработчика = ПолучитьИмяВременногоФайла("epf");
			
			ОбработчикXDTO.Записать(ПолноеИмяОбработчика);
			
			обработчик = ВнешниеОбработки.Создать(ПолноеИмяОбработчика, Ложь);
			
		КонецЕсли;
		
	Исключение
		
		Обработчик = Неопределено;
		
	КонецПопытки;
	
	Возврат Обработчик;
	
КонецФункции // ПолучитьДанные()
